# 데이터 그룹분석 & 피봇팅 연습문제

필요한 모듈 임포트

In [1]:
import pandas as pd
import numpy as np

In [2]:
import seaborn as sns

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

### 연습문제 1. 붓꽃(iris) 데이터

- seaborn 라이브러리에 있는 'iris' 데이터 로드

In [4]:
# 붓꽃(iris) 데이터 로드
iris = sns.load_dataset('iris')

#### iris 데이터를 이용하여 다음의 문제를 해결하시오.

#### 1) 데이터 살펴보기

- 데이터 앞부분 보기

In [5]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

- 데이터 정보 확인(변수, 데이터유형 등)

In [6]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

#### 2) 붓꽃 품종(species)별로 데이터 그룹화

In [7]:
# 붓꽃 종 별로 그룹핑
groups = iris.groupby('species')
groups.groups

{'setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

#### 3) 품종별 꽃잎길이(petal_length)의 평균을 구하시오.

In [8]:
groups['petal_length'].mean()

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64

#### 3) 품종별 꽃받침길이(sepal_length)의 평균을 구하시오.

In [9]:
groups.sepal_length.mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

----

### 연습문제 2. Tips 데이터

tips 데이터를 이용하여 다음의 문제를 해결하시오.

In [10]:
# seaborn 라이브러리의  tips 데이터 로드
tips = sns.load_dataset('tips')

#### 1) 데이터 살펴보기
- 데이터의 뒷부분 보기

In [12]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

변수 설명
- total_bill : 지불금액
- tips : 팁금액
- sex : 고객의 성별
- smoker : 흡연구역여부 (Yes: 흡연구역, No: 금연구역)
- time : 시간대
- size : 테이블당 인원수

데이터 정보 확인(변수, 데이터유형 등)

In [13]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

#### 2)  'total_bill' 대비 팁 요금(tip)의 비율을 계산하고 'tip_pt' 열로 저장하시오.

In [14]:
tips['tip_pt'] = tips.tip / tips.total_bill
tips.tail()

     total_bill   tip     sex smoker   day    time  size    tip_pt
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

#### 3) 요일별 손님의 수는?

In [19]:
groups = tips.groupby('day')
groups.count()
groups.size()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/3136332569.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups = tips.groupby('day')

      total_bill  tip  sex  smoker  time  size  tip_pt
day
Thur          62   62   62      62    62    62      62
Fri           19   19   19      19    19    19      19
Sat           87   87   87      87    87    87      87
Sun           76   76   76      76    76    76      76

day
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64

- 팁의 비율이 요일과 점심/저녁 여부, 인원수에 어떤 영향을 받는지 살펴본다.

- 어떤 요인이 가장 크게 작용하는지 판단할 수 있는 방법이 있는가?

#### 4) 요일별 테이블당 평균인원수는?

In [22]:
groups['size'].mean()
tips.groupby('day')['size'].mean()

day
Thur    2.451613
Fri     2.105263
Sat     2.517241
Sun     2.842105
Name: size, dtype: float64

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/2701540991.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips.groupby('day')['size'].mean()

day
Thur    2.451613
Fri     2.105263
Sat     2.517241
Sun     2.842105
Name: size, dtype: float64

#### 5) 시간대(점심/저녁) 별 손님 수 비교

In [25]:
groups_time = tips.groupby('time')
groups_time.size()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/3779410122.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups_time = tips.groupby('time')

time
Lunch      68
Dinner    176
dtype: int64

#### 6) 시간대(점심/저녁) 별 테이블당 평균인원수

In [28]:
groups_time['size'].mean()

time
Lunch     2.411765
Dinner    2.630682
Name: size, dtype: float64

In [27]:
groups_time[['size']].mean()

            size
time
Lunch   2.411765
Dinner  2.630682

#### 7) 각 요일에 따른 시간대별(점심/저녁) 손님 수를 피봇테이블로 작성

In [30]:
tips.pivot_table(index='day', columns='time', values='size', aggfunc='count')

time  Lunch  Dinner
day
Thur     61       1
Fri       7      12
Sat       0      87
Sun       0      76

#### 8) 요일별 테이블당 평균 인원수와  최대인원수, 최소인원수를 피봇테이블로 작성

In [31]:
tips.pivot_table(index='day', values='size', aggfunc=['mean', 'max', 'min'])

          mean  max  min
          size size size
day
Thur  2.451613    6    1
Fri   2.105263    4    1
Sat   2.517241    5    1
Sun   2.842105    6    2

#### 9) 요일별 시간대에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [32]:
tips.pivot_table(index=['day', 'time'], values=['size'], aggfunc= ['mean', 'max', 'min'])

                 mean  max  min
                 size size size
day  time
Thur Lunch   2.459016  6.0  1.0
     Dinner  2.000000  2.0  2.0
Fri  Lunch   2.000000  3.0  1.0
     Dinner  2.166667  4.0  2.0
Sat  Dinner  2.517241  5.0  1.0
Sun  Dinner  2.842105  6.0  2.0

#### 10) 각 시간대별로 요일에 따른 테이블당 평균, 최대, 최소 인원수를 피봇테이블로 작성

In [35]:
#소숫점 6자리로 표현되는게 기본임 -> 두자리 포맷으로 설정하는 함수
pd.options.display.float_format = '{:.2f}'.format

In [36]:
tips.pivot_table(index='time', columns='day', values='size', aggfunc=['mean', 'max', 'min'])

       mean                 max                 min
day    Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun
time
Lunch  2.46 2.00  NaN  NaN 6.00 3.00  NaN  NaN 1.00 1.00  NaN  NaN
Dinner 2.00 2.17 2.52 2.84 2.00 4.00 5.00 6.00 2.00 2.00 1.00 2.00

In [37]:
#NaN을 0으로 바꾸기
tips.pivot_table(index='time', columns='day', values='size', 
                 aggfunc=['mean', 'max', 'min']).fillna(0)

       mean                 max                 min
day    Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun Thur  Fri  Sat  Sun
time
Lunch  2.46 2.00 0.00 0.00 6.00 3.00 0.00 0.00 1.00 1.00 0.00 0.00
Dinner 2.00 2.17 2.52 2.84 2.00 4.00 5.00 6.00 2.00 2.00 1.00 2.00

#### 11) 요일별 tip_pt의 평균 계산

In [38]:
groups_day = tips.groupby('day')
groups_day['tip_pt'].mean()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/3843862860.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups_day = tips.groupby('day')

day
Thur   0.16
Fri    0.17
Sat    0.15
Sun    0.17
Name: tip_pt, dtype: float64

In [39]:
groups_day = tips.groupby('day')
groups_day[['tip_pt']].mean()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/3652054816.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  groups_day = tips.groupby('day')

      tip_pt
day
Thur    0.16
Fri     0.17
Sat     0.15
Sun     0.17

#### 12) 시간대별 tip_pt의 평균 계산

In [40]:
groups_time[['tip_pt']].mean()

        tip_pt
time
Lunch     0.16
Dinner    0.16

#### 11) 각 요일마다 시간대(점심/저녁) 별 tip_pt의 평균

In [41]:
pd.options.display.float_format = '{:.4f}'.format

In [42]:
tips.groupby(['day', 'time'])[['tip_pt']].mean()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/2283460347.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips.groupby(['day', 'time'])[['tip_pt']].mean()

             tip_pt
day  time
Thur Lunch   0.1613
     Dinner  0.1597
Fri  Lunch   0.1888
     Dinner  0.1589
Sat  Lunch      NaN
     Dinner  0.1532
Sun  Lunch      NaN
     Dinner  0.1669

#### 12) 요일마다 시간대(점심/저녁) 별 평균인원수와 팁비율의 평균 계산

In [45]:
#결측치 NaN도 같이 나옴
tips.groupby(['day', 'time'], observed=False)[['size','tip_pt']].mean()

              size  tip_pt
day  time
Thur Lunch  2.4590  0.1613
     Dinner 2.0000  0.1597
Fri  Lunch  2.0000  0.1888
     Dinner 2.1667  0.1589
Sat  Lunch     NaN     NaN
     Dinner 2.5172  0.1532
Sun  Lunch     NaN     NaN
     Dinner 2.8421  0.1669

In [44]:
#결측치 없이 제공
tips.pivot_table(index=['day','time'], values=['size', 'tip_pt'], aggfunc='mean')

              size  tip_pt
day  time
Thur Lunch  2.4590  0.1613
     Dinner 2.0000  0.1597
Fri  Lunch  2.0000  0.1888
     Dinner 2.1667  0.1589
Sat  Dinner 2.5172  0.1532
Sun  Dinner 2.8421  0.1669

----

### 연습문제 3. titanic 데이터

타이타닉 승객 데이터를 이용하여 다음 분석을 수행하시오.

#### 1) 데이터 로드

In [80]:
# seaborn 라이브러리의 titanic 데이터 로드
titanic = sns.load_dataset('titanic')

#### 2) 데이터 살펴보기

In [81]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 3) 나이(age)를 qcut을 사용하여 세 개의 그룹으로 만든다.
- label은 ['청년','중년','장년']

In [82]:
agegroup= pd.qcut(titanic['age'], 3, labels=['청년','중년','장년'])
agegroup

0       청년
1       장년
2       중년
3       장년
4       장년
      ...
886     중년
887     청년
888    NaN
889     중년
890     중년
Name: age, Length: 891, dtype: category
Categories (3, object): ['청년' < '중년' < '장년']

#### 4) 선실(class), 성별(sex), 나이 그룹에 따른 생존여부 그룹으로 그룹화

In [83]:
group = titanic.groupby(['class','sex',agegroup])['alive']
group.size()

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/2336025229.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  group = titanic.groupby(['class','sex',agegroup])['alive']

class   sex     age
First   female  청년      22
                중년      19
                장년      44
        male    청년      10
                중년      22
                장년      69
Second  female  청년      20
                중년      33
                장년      21
        male    청년      28
                중년      39
                장년      32
Third   female  청년      59
                중년      27
                장년      16
        male    청년     107
                중년      92
                장년      54
Name: alive, dtype: int64

#### 5) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 데이터프레임으로 생성

- 행에는 선실, 성별, 나이그룹에 대한 다중 인덱스를 사용하고 열에는 선실 인덱스를 사용한다.

In [84]:
df = titanic.pivot_table(index=['class','sex', agegroup, 'alive'], 
                          values='survived', aggfunc='count')
df

                         survived
class  sex    age alive
First  female 청년  no            1
                  yes          21
              중년  no            1
                  yes          18
              장년  no            1
                  yes          43
       male   청년  no            5
                  yes           5
              중년  no           11
                  yes          11
              장년  no           45
                  yes          24
Second female 청년  no            0
                  yes          20
              중년  no            3
                  yes          30
              장년  no            3
                  yes          18
       male   청년  no           18
                  yes          10
              중년  no           36
                  yes           3
              장년  no           30
                  yes           2
Third  female 청년  no           29
                  yes          30
              중년  no           14
                  yes          13
              장년  no           12
                  yes           4
       male   청년  no           90
                  yes          17
              중년  no           74
                  yes          18
              장년  no           51
                  yes           3

#### 6) 선실, 성별, 나이 그룹에 따른 생존여부에 대한 빈도를 피봇테이블로 생성

In [85]:
df2 = titanic.pivot_table(index=['sex', agegroup], columns=['class','alive'],
                          values='survived', aggfunc='count')
df2

class      First     Second     Third
alive         no yes     no yes    no yes
sex    age
female 청년      1  21      0  20    29  30
       중년      1  18      3  30    14  13
       장년      1  43      3  18    12   4
male   청년      5   5     18  10    90  17
       중년     11  11     36   3    74  18
       장년     45  24     30   2    51   3

In [86]:
df2.iloc[0:2]

class      First     Second     Third
alive         no yes     no yes    no yes
sex    age
female 청년      1  21      0  20    29  30
       중년      1  18      3  30    14  13

#### 7) 6)에서 생성한 데이터프레임을 이용하여 성별과 나이그룹에 따른 First class 인원수를 파악하라

In [90]:
df2['First'].sum(axis=1)

sex     age
female  청년     22
        중년     19
        장년     44
male    청년     10
        중년     22
        장년     69
dtype: int64

#### 8) 6)에서 생성한 데이터프레임을 이용하여 성별, 나이그룹, 선실별에 따른 생존율을 파악하시오.
- 행은 성별, 나이그룹의 다중인덱스로 하고, 열은 선실(class)로 한다.
- 생존률은 해당 그룹의 생존 인원수를 전체 인원수로 나눈 값이다.

In [91]:
df2

class      First     Second     Third
alive         no yes     no yes    no yes
sex    age
female 청년      1  21      0  20    29  30
       중년      1  18      3  30    14  13
       장년      1  43      3  18    12   4
male   청년      5   5     18  10    90  17
       중년     11  11     36   3    74  18
       장년     45  24     30   2    51   3

In [92]:
pivot2 = df2.stack(level='alive')
pivot2

class             First  Second  Third
sex    age alive
female 청년  no         1       0     29
           yes       21      20     30
       중년  no         1       3     14
           yes       18      30     13
       장년  no         1       3     12
           yes       43      18      4
male   청년  no         5      18     90
           yes        5      10     17
       중년  no        11      36     74
           yes       11       3     18
       장년  no        45      30     51
           yes       24       2      3

In [93]:
pivot3 =pivot2.groupby(['sex','age']).sum()
pivot4 = pivot2.drop(index='no', level='alive').droplevel(level='alive')
pivot4 / pivot3 * 100

/var/folders/d8/9nns59h14_z0hzcqldblr_v00000gn/T/ipykernel_1598/3662633728.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  pivot3 =pivot2.groupby(['sex','age']).sum()

class        First   Second   Third
sex    age
female 청년  95.4545 100.0000 50.8475
       중년  94.7368  90.9091 48.1481
       장년  97.7273  85.7143 25.0000
male   청년  50.0000  35.7143 15.8879
       중년  50.0000   7.6923 19.5652
       장년  34.7826   6.2500  5.5556

In [94]:
First = df2['First','yes']/df2['First'].sum(axis=1)*100
Second = df2['Second','yes']/df2['Second'].sum(axis=1)*100
Third = df2['Third','yes']/df2['Third'].sum(axis=1)*100
First

sex     age
female  청년    95.4545
        중년    94.7368
        장년    97.7273
male    청년    50.0000
        중년    50.0000
        장년    34.7826
dtype: float64

In [96]:
data = {'First' : df2['First','yes']/df2['First'].sum(axis=1)*100,
'Second' : df2['Second','yes']/df2['Second'].sum(axis=1)*100,
'Third' : df2['Third','yes']/df2['Third'].sum(axis=1)*100}

survived_rate = pd.DataFrame(data, columns=['First', 'Second','Third'])
survived_rate

             First   Second   Third
sex    age
female 청년  95.4545 100.0000 50.8475
       중년  94.7368  90.9091 48.1481
       장년  97.7273  85.7143 25.0000
male   청년  50.0000  35.7143 15.8879
       중년  50.0000   7.6923 19.5652
       장년  34.7826   6.2500  5.5556

In [33]:
#결과 확인

                   First   Second   Third
sex    age_group
female 청년        95.4545 100.0000 50.8475
       중년        94.7368  90.9091 48.1481
       장년        97.7273  85.7143 25.0000
male   청년        50.0000  35.7143 15.8879
       중년        50.0000   7.6923 19.5652
       장년        34.7826   6.2500  5.5556

#### 9) 성별 및 선실에 의한 생존율을 피봇 데이터 형태로 만든다.

In [97]:
survived_rate.pivot_table(index='sex')

         First  Second   Third
sex
female 95.9729 92.2078 41.3319
male   44.9275 16.5522 13.6695

In [34]:
#결과 확인

         First  Second   Third
sex
female 95.9729 92.2078 41.3319
male   44.9275 16.5522 13.6695